prophetricker/EdgeCare-GD32-Industrial-Violation-Detection-Terminal/EdgeCare_GD32_Industrial_Violation_Terminal/GD32H759I_START_Demo_Suites/Projects/01_EdgeCare_Industrial_Violation_Terminal/main.c
/*!
    \file    main.c
    \brief   EdgeCare state-machine bring-up for GD32H759

    Current bring-up scope:
      - active-low alarm lamp on PA8
      - USART0 printf log on EVAL_COM
      - LD2410 digital OUT presence trigger on PF8
      - OV5640/OV2640 SCCB ID probe on PB10/PB11
      - DCI/DMA one-shot capture probe with timeout
*/

#include "gd32h7xx.h"
#include "gd32h759i_start.h"
#include "systick.h"
#include <stdio.h>
#include <string.h>

#define ALARM_GPIO_PORT        GPIOA
#define ALARM_GPIO_PIN         GPIO_PIN_8
#define ALARM_GPIO_RCU         RCU_GPIOA

#define RADAR_GPIO_PORT        GPIOF
#define RADAR_GPIO_PIN         GPIO_PIN_8
#define RADAR_GPIO_RCU         RCU_GPIOF
#define RADAR_ACTIVE_HIGH      1U

#define CAMERA_SCCB            I2C1
#define CAMERA_SCCB_IDX        IDX_I2C1
#define CAMERA_SCCB_RCU        RCU_I2C1
#define CAMERA_SCCB_GPIO_RCU   RCU_GPIOB
#define CAMERA_SCCB_GPIO_PORT  GPIOB
#define CAMERA_SCCB_SCL_PIN    GPIO_PIN_10
#define CAMERA_SCCB_SDA_PIN    GPIO_PIN_11
#define CAMERA_SCCB_AF         GPIO_AF_4

#define CAMERA_CTRL_GPIO_PORT  GPIOD
#define CAMERA_CTRL_GPIO_RCU   RCU_GPIOD
#define CAMERA_RES_PIN         GPIO_PIN_0
#define CAMERA_PWON_PIN        GPIO_PIN_1

#define CAMERA_SCCB_ADDR       0x78U
#define CAMERA_TIMEOUT         1000000U
#define CAMERA_FRAME_WIDTH     320U
#define CAMERA_FRAME_HEIGHT    240U
#define CAMERA_FRAME_BPP       2U
#define CAMERA_CAPTURE_BYTES   (CAMERA_FRAME_WIDTH * CAMERA_FRAME_HEIGHT * CAMERA_FRAME_BPP)
#define CAMERA_CAPTURE_WORDS   (CAMERA_CAPTURE_BYTES / 4U)
#define CAMERA_CAPTURE_TIMEOUT 60000000U
#define MODEL_INPUT_WIDTH      96U
#define MODEL_INPUT_HEIGHT     96U
#define MODEL_INPUT_BYTES      (MODEL_INPUT_WIDTH * MODEL_INPUT_HEIGHT)
#define DCI_DATA_ADDRESS       ((uint32_t)&DCI_DATA)

#define EDGECARE_DEVICE_ID     "edgecare-01"
#define EDGECARE_LOG_PERIOD_MS 500U

typedef enum {
    EDGECARE_STATE_IDLE = 0,
    EDGECARE_STATE_ALARM
} edgecare_state_t;

typedef struct {
    edgecare_state_t state;
    uint32_t ts_ms;
    uint32_t seq;
    uint8_t radar_triggered;
    uint8_t alarm_active;
    uint32_t infer_ms;
    uint8_t confidence_percent;
} edgecare_context_t;

typedef struct {
    uint16_t reg;
    uint8_t value;
} camera_reg8_t;

typedef struct {
    uint8_t intrusion;
    uint8_t confidence_percent;
    uint8_t mean;
    uint8_t contrast;
} edgecare_infer_result_t;

static edgecare_context_t g_edgecare = {
    EDGECARE_STATE_IDLE,
    0U,
    0U,
    0U,
    0U,
    0U,
    0U
};

static uint32_t g_camera_capture_buffer[CAMERA_CAPTURE_WORDS] __attribute__((aligned(32)));
static uint8_t g_model_input_gray[MODEL_INPUT_BYTES] __attribute__((aligned(32)));

static const camera_reg8_t g_ov5640_qvga_yuv_probe_regs[] = {
    {0x3103U, 0x11U},
    {0x3008U, 0x42U},
    {0x3103U, 0x03U},
    {0x3017U, 0xFFU},
    {0x3018U, 0xFFU},
    {0x3034U, 0x1AU},
    {0x3035U, 0x11U},
    {0x3036U, 0x46U},
    {0x3037U, 0x13U},
    {0x3108U, 0x01U},
    {0x3630U, 0x36U},
    {0x3631U, 0x0EU},
    {0x3632U, 0xE2U},
    {0x3633U, 0x12U},
    {0x3621U, 0xE0U},
    {0x3704U, 0xA0U},
    {0x3703U, 0x5AU},
    {0x3715U, 0x78U},
    {0x3717U, 0x01U},
    {0x370BU, 0x60U},
    {0x3705U, 0x1AU},
    {0x3905U, 0x02U},
    {0x3906U, 0x10U},
    {0x3901U, 0x0AU},
    {0x3731U, 0x12U},
    {0x3600U, 0x08U},
    {0x3601U, 0x33U},
    {0x302DU, 0x60U},
    {0x3620U, 0x52U},
    {0x371BU, 0x20U},
    {0x471CU, 0x50U},
    {0x3A13U, 0x43U},
    {0x3A18U, 0x00U},
    {0x3A19U, 0xF8U},
    {0x3635U, 0x13U},
    {0x3636U, 0x03U},
    {0x3634U, 0x40U},
    {0x3622U, 0x01U},
    {0x3C01U, 0x34U},
    {0x3C04U, 0x28U},
    {0x3C05U, 0x98U},
    {0x3C06U, 0x00U},
    {0x3C07U, 0x08U},
    {0x3C08U, 0x00U},
    {0x3C09U, 0x1CU},
    {0x3C0AU, 0x9CU},
    {0x3C0BU, 0x40U},
    {0x3820U, 0x41U},
    {0x3821U, 0x07U},
    {0x3814U, 0x31U},
    {0x3815U, 0x31U},
    {0x3000U, 0x00U},
    {0x3002U, 0x1CU},
    {0x3004U, 0xFFU},
    {0x3006U, 0xC3U},
    {0x300EU, 0x58U},
    {0x302EU, 0x00U},
    {0x4300U, 0x30U},
    {0x501FU, 0x00U},
    {0x4713U, 0x03U},
    {0x4407U, 0x04U},
    {0x460BU, 0x35U},
    {0x460CU, 0x22U},
    {0x3824U, 0x02U},
    {0x5000U, 0xA7U},
    {0x5001U, 0xA3U},
    {0x3800U, 0x00U},
    {0x3801U, 0x00U},
    {0x3802U, 0x00U},
    {0x3803U, 0x04U},
    {0x3804U, 0x0AU},
    {0x3805U, 0x3FU},
    {0x3806U, 0x07U},
    {0x3807U, 0x9BU},
    {0x3808U, 0x01U},
    {0x3809U, 0x40U},
    {0x380AU, 0x00U},
    {0x380BU, 0xF0U},
    {0x380CU, 0x07U},
    {0x380DU, 0x68U},
    {0x380EU, 0x03U},
    {0x380FU, 0xD8U},
    {0x3810U, 0x00U},
    {0x3811U, 0x10U},
    {0x3812U, 0x00U},
    {0x3813U, 0x06U},
    {0x3618U, 0x00U},
    {0x3612U, 0x29U},
    {0x3708U, 0x64U},
    {0x3709U, 0x52U},
    {0x370CU, 0x03U},
    {0x3A02U, 0x03U},
    {0x3A03U, 0xD8U},
    {0x3A08U, 0x01U},
    {0x3A09U, 0x27U},
    {0x3A0AU, 0x00U},
    {0x3A0BU, 0xF6U},
    {0x3A0EU, 0x03U},
    {0x3A0DU, 0x04U},
    {0x3A14U, 0x03U},
    {0x3A15U, 0xD8U},
    {0x4001U, 0x02U},
    {0x4004U, 0x02U},
    {0x3008U, 0x02U}
};

static void cache_enable(void)
{
    SCB_EnableICache();
    SCB_EnableDCache();
}

static const char *edgecare_state_name(edgecare_state_t state)
{
    switch(state) {
    case EDGECARE_STATE_IDLE:
        return "IDLE";
    case EDGECARE_STATE_ALARM:
        return "ALARM";
    default:
        return "UNKNOWN";
    }
}

static void alarm_gpio_init(void)
{
    rcu_periph_clock_enable(ALARM_GPIO_RCU);

    gpio_mode_set(ALARM_GPIO_PORT, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, ALARM_GPIO_PIN);
    gpio_output_options_set(ALARM_GPIO_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, ALARM_GPIO_PIN);

    /* The alarm module is active-low, so drive high to keep it off at boot. */
    gpio_bit_set(ALARM_GPIO_PORT, ALARM_GPIO_PIN);
}

static void radar_gpio_init(void)
{
    rcu_periph_clock_enable(RADAR_GPIO_RCU);

    gpio_mode_set(RADAR_GPIO_PORT, GPIO_MODE_INPUT, GPIO_PUPD_PULLDOWN, RADAR_GPIO_PIN);
}

static uint8_t radar_is_triggered(void)
{
    FlagStatus level = gpio_input_bit_get(RADAR_GPIO_PORT, RADAR_GPIO_PIN);

