prophetricker/EdgeCare-GD32-Industrial-Violation-Detection-Terminal/EdgeCare_GD32_Industrial_Violation_Terminal/GD32H759I_START_Demo_Suites/Projects/01_EdgeCare_Industrial_Violation_Terminal/main.c
#if RADAR_ACTIVE_HIGH
    return (SET == level) ? 1U : 0U;
#else
    return (RESET == level) ? 1U : 0U;
#endif
}

static uint8_t camera_wait_flag(uint32_t flag)
{
    uint32_t timeout = CAMERA_TIMEOUT;

    while(SET != i2c_flag_get(CAMERA_SCCB, flag)) {
        if(SET == i2c_flag_get(CAMERA_SCCB, I2C_FLAG_NACK)) {
            i2c_flag_clear(CAMERA_SCCB, I2C_FLAG_NACK);
            return 0U;
        }

        if(0U == timeout--) {
            return 0U;
        }
    }

    return 1U;
}

static void camera_sccb_init(void)
{
    rcu_i2c_clock_config(CAMERA_SCCB_IDX, RCU_I2CSRC_IRC64MDIV);
    rcu_periph_clock_enable(CAMERA_SCCB_GPIO_RCU);
    rcu_periph_clock_enable(CAMERA_CTRL_GPIO_RCU);
    rcu_periph_clock_enable(CAMERA_SCCB_RCU);

    gpio_af_set(CAMERA_SCCB_GPIO_PORT, CAMERA_SCCB_AF, CAMERA_SCCB_SCL_PIN);
    gpio_af_set(CAMERA_SCCB_GPIO_PORT, CAMERA_SCCB_AF, CAMERA_SCCB_SDA_PIN);

    gpio_mode_set(CAMERA_SCCB_GPIO_PORT, GPIO_MODE_AF, GPIO_PUPD_PULLUP,
                  CAMERA_SCCB_SCL_PIN | CAMERA_SCCB_SDA_PIN);
    gpio_output_options_set(CAMERA_SCCB_GPIO_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_12MHZ,
                            CAMERA_SCCB_SCL_PIN | CAMERA_SCCB_SDA_PIN);

    gpio_mode_set(CAMERA_CTRL_GPIO_PORT, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE,
                  CAMERA_RES_PIN | CAMERA_PWON_PIN);
    gpio_output_options_set(CAMERA_CTRL_GPIO_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_12MHZ,
                            CAMERA_RES_PIN | CAMERA_PWON_PIN);

    /* Default guess: RES high releases reset, PWON/PWDN low powers the sensor. */
    gpio_bit_reset(CAMERA_CTRL_GPIO_PORT, CAMERA_PWON_PIN);
    gpio_bit_reset(CAMERA_CTRL_GPIO_PORT, CAMERA_RES_PIN);
    delay_1ms(5U);
    gpio_bit_set(CAMERA_CTRL_GPIO_PORT, CAMERA_RES_PIN);
    delay_1ms(20U);

    i2c_deinit(CAMERA_SCCB);
    i2c_timing_config(CAMERA_SCCB, 0U, 6U, 0U);
    i2c_master_clock_config(CAMERA_SCCB, 0x26U, 0x73U);
    i2c_address_config(CAMERA_SCCB, 0x00U, I2C_ADDFORMAT_7BITS);
    i2c_enable(CAMERA_SCCB);
}

static uint8_t camera_sccb_read_reg8(uint8_t reg, uint8_t *data)
{
    if(SET == i2c_flag_get(CAMERA_SCCB, I2C_FLAG_I2CBSY)) {
        return 0U;
    }

    i2c_master_addressing(CAMERA_SCCB, CAMERA_SCCB_ADDR, I2C_MASTER_TRANSMIT);
    i2c_transfer_byte_number_config(CAMERA_SCCB, 0x1U);
    i2c_automatic_end_enable(CAMERA_SCCB);
    i2c_start_on_bus(CAMERA_SCCB);

    i2c_data_transmit(CAMERA_SCCB, reg);
    if(!camera_wait_flag(I2C_FLAG_TI)) {
        return 0U;
    }
    if(!camera_wait_flag(I2C_FLAG_STPDET)) {
        return 0U;
    }
    i2c_flag_clear(CAMERA_SCCB, I2C_FLAG_STPDET);

    i2c_master_addressing(CAMERA_SCCB, CAMERA_SCCB_ADDR, I2C_MASTER_RECEIVE);
    i2c_transfer_byte_number_config(CAMERA_SCCB, 0x1U);
    i2c_automatic_end_enable(CAMERA_SCCB);
    delay_1ms(1U);
    i2c_start_on_bus(CAMERA_SCCB);

    if(!camera_wait_flag(I2C_FLAG_RBNE)) {
        return 0U;
    }

    *data = (uint8_t)i2c_data_receive(CAMERA_SCCB);

    if(!camera_wait_flag(I2C_FLAG_STPDET)) {
        return 0U;
    }
    i2c_flag_clear(CAMERA_SCCB, I2C_FLAG_STPDET);

    return 1U;
}

static uint8_t camera_sccb_read_reg16(uint16_t reg, uint8_t *data)
{
    if(SET == i2c_flag_get(CAMERA_SCCB, I2C_FLAG_I2CBSY)) {
        return 0U;
    }

    i2c_master_addressing(CAMERA_SCCB, CAMERA_SCCB_ADDR, I2C_MASTER_TRANSMIT);
    i2c_transfer_byte_number_config(CAMERA_SCCB, 0x2U);
    i2c_automatic_end_enable(CAMERA_SCCB);
    i2c_start_on_bus(CAMERA_SCCB);

    i2c_data_transmit(CAMERA_SCCB, (uint8_t)(reg >> 8U));
    if(!camera_wait_flag(I2C_FLAG_TI)) {
        return 0U;
    }

    i2c_data_transmit(CAMERA_SCCB, (uint8_t)(reg & 0xFFU));
    if(!camera_wait_flag(I2C_FLAG_TI)) {
        return 0U;
    }

    if(!camera_wait_flag(I2C_FLAG_STPDET)) {
        return 0U;
    }
    i2c_flag_clear(CAMERA_SCCB, I2C_FLAG_STPDET);

    i2c_master_addressing(CAMERA_SCCB, CAMERA_SCCB_ADDR, I2C_MASTER_RECEIVE);
    i2c_transfer_byte_number_config(CAMERA_SCCB, 0x1U);
    i2c_automatic_end_enable(CAMERA_SCCB);
    delay_1ms(1U);
    i2c_start_on_bus(CAMERA_SCCB);

    if(!camera_wait_flag(I2C_FLAG_RBNE)) {
        return 0U;
    }

    *data = (uint8_t)i2c_data_receive(CAMERA_SCCB);

    if(!camera_wait_flag(I2C_FLAG_STPDET)) {
        return 0U;
    }
    i2c_flag_clear(CAMERA_SCCB, I2C_FLAG_STPDET);

    return 1U;
}

static uint8_t camera_sccb_write_reg16(uint16_t reg, uint8_t data)
{
    if(SET == i2c_flag_get(CAMERA_SCCB, I2C_FLAG_I2CBSY)) {
        return 0U;
    }

    i2c_master_addressing(CAMERA_SCCB, CAMERA_SCCB_ADDR, I2C_MASTER_TRANSMIT);
    i2c_transfer_byte_number_config(CAMERA_SCCB, 0x3U);
    i2c_automatic_end_enable(CAMERA_SCCB);
    i2c_start_on_bus(CAMERA_SCCB);

    i2c_data_transmit(CAMERA_SCCB, (uint8_t)(reg >> 8U));
    if(!camera_wait_flag(I2C_FLAG_TI)) {
        return 0U;
    }

    i2c_data_transmit(CAMERA_SCCB, (uint8_t)(reg & 0xFFU));
    if(!camera_wait_flag(I2C_FLAG_TI)) {
        return 0U;
    }

    i2c_data_transmit(CAMERA_SCCB, data);
    if(!camera_wait_flag(I2C_FLAG_TI)) {
        return 0U;
    }

    if(!camera_wait_flag(I2C_FLAG_STPDET)) {
        return 0U;
    }
    i2c_flag_clear(CAMERA_SCCB, I2C_FLAG_STPDET);

    return 1U;
}

static uint8_t edgecare_camera_id_probe(void)
{
    uint8_t ov5640_id_h = 0U;
    uint8_t ov5640_id_l = 0U;
    uint8_t ov2640_id_h = 0U;
    uint8_t ov2640_id_l = 0U;
    uint8_t ov5640_detected = 0U;

    camera_sccb_init();

    if(camera_sccb_read_reg16(0x300AU, &ov5640_id_h) &&
       camera_sccb_read_reg16(0x300BU, &ov5640_id_l)) {
        printf("camera_id: ov5640_regs[0x300A,0x300B]=0x%02X 0x%02X\r\n",
               ov5640_id_h, ov5640_id_l);
        ov5640_detected = ((0x56U == ov5640_id_h) && (0x40U == ov5640_id_l)) ? 1U : 0U;
    } else {
        printf("camera_id: OV5640 ID read timeout/no ack on PB10/PB11\r\n");
    }

    if((0U == ov5640_detected) &&
       camera_sccb_read_reg8(0x0AU, &ov2640_id_h) &&
       camera_sccb_read_reg8(0x0BU, &ov2640_id_l)) {
        printf("camera_id: ov2640_regs[0x0A,0x0B]=0x%02X 0x%02X\r\n",
               ov2640_id_h, ov2640_id_l);
    }

    while(RESET == usart_flag_get(EVAL_COM, USART_FLAG_TC)) {
    }

    return ov5640_detected;
}

