prophetricker/EdgeCare-GD32-Industrial-Violation-Detection-Terminal/EdgeCare_GD32_Industrial_Violation_Terminal/GD32H759I_START_Demo_Suites/Projects/01_EdgeCare_Industrial_Violation_Terminal/main.c
static uint8_t edgecare_ov5640_qvga_stream_init(void)
{
    uint32_t i;
    uint8_t stream_ctl = 0U;
    uint8_t width_h = 0U;
    uint8_t width_l = 0U;
    uint8_t height_h = 0U;
    uint8_t height_l = 0U;

    printf("camera_init: ov5640 qvga yuv probe regs=%lu source=OV5640 app note 13.1.1/13.1.2\r\n",
           (unsigned long)(sizeof(g_ov5640_qvga_yuv_probe_regs) / sizeof(g_ov5640_qvga_yuv_probe_regs[0])));

    if(!camera_sccb_write_reg16(0x3008U, 0x82U)) {
        printf("camera_init: soft_reset write failed\r\n");
        return 0U;
    }
    delay_1ms(10U);

    for(i = 0U; i < (sizeof(g_ov5640_qvga_yuv_probe_regs) / sizeof(g_ov5640_qvga_yuv_probe_regs[0])); i++) {
        if(!camera_sccb_write_reg16(g_ov5640_qvga_yuv_probe_regs[i].reg,
                                    g_ov5640_qvga_yuv_probe_regs[i].value)) {
            printf("camera_init: write_failed reg=0x%04lX value=0x%02X index=%lu\r\n",
                   (unsigned long)g_ov5640_qvga_yuv_probe_regs[i].reg,
                   g_ov5640_qvga_yuv_probe_regs[i].value,
                   (unsigned long)i);
            return 0U;
        }
        if(0x3008U == g_ov5640_qvga_yuv_probe_regs[i].reg) {
            delay_1ms(5U);
        }
    }

    delay_1ms(100U);

    (void)camera_sccb_read_reg16(0x3008U, &stream_ctl);
    (void)camera_sccb_read_reg16(0x3808U, &width_h);
    (void)camera_sccb_read_reg16(0x3809U, &width_l);
    (void)camera_sccb_read_reg16(0x380AU, &height_h);
    (void)camera_sccb_read_reg16(0x380BU, &height_l);
    printf("camera_init: readback 3008=0x%02X size=%ux%u\r\n",
           stream_ctl,
           (uint16_t)(((uint16_t)width_h << 8U) | width_l),
           (uint16_t)(((uint16_t)height_h << 8U) | height_l));

    return 1U;
}

static void camera_dvp_gpio_activity_probe(void)
{
    uint32_t burst;
    uint32_t i;
    uint32_t pclk_edges = 0U;
    uint32_t href_edges = 0U;
    uint32_t sync_edges = 0U;
    uint32_t href_high_samples = 0U;
    uint32_t sync_high_samples = 0U;
    FlagStatus pclk_prev;
    FlagStatus href_prev;
    FlagStatus sync_prev;
    FlagStatus pclk_now;
    FlagStatus href_now;
    FlagStatus sync_now;

    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);

    gpio_mode_set(GPIOA, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_4 | GPIO_PIN_6);
    gpio_mode_set(GPIOB, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_7);

    pclk_prev = gpio_input_bit_get(GPIOA, GPIO_PIN_6);
    href_prev = gpio_input_bit_get(GPIOA, GPIO_PIN_4);
    sync_prev = gpio_input_bit_get(GPIOB, GPIO_PIN_7);

    for(burst = 0U; burst < 80U; burst++) {
        for(i = 0U; i < 50000U; i++) {
            pclk_now = gpio_input_bit_get(GPIOA, GPIO_PIN_6);
            href_now = gpio_input_bit_get(GPIOA, GPIO_PIN_4);
            sync_now = gpio_input_bit_get(GPIOB, GPIO_PIN_7);

            if(SET == href_now) {
                href_high_samples++;
            }
            if(SET == sync_now) {
                sync_high_samples++;
            }

            if(pclk_now != pclk_prev) {
                pclk_edges++;
                pclk_prev = pclk_now;
            }
            if(href_now != href_prev) {
                href_edges++;
                href_prev = href_now;
            }
            if(sync_now != sync_prev) {
                sync_edges++;
                sync_prev = sync_now;
            }
        }
    }

    printf("camera_dvp_gpio: bursts=80 samples_per_burst=50000 pclk_edges=%lu href_edges=%lu sync_edges=%lu href_high=%lu sync_high=%lu pclk=%u href=%u sync=%u\r\n",
           (unsigned long)pclk_edges,
           (unsigned long)href_edges,
           (unsigned long)sync_edges,
           (unsigned long)href_high_samples,
           (unsigned long)sync_high_samples,
           (SET == pclk_prev) ? 1U : 0U,
           (SET == href_prev) ? 1U : 0U,
           (SET == sync_prev) ? 1U : 0U);
}

static void camera_dci_gpio_init(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);
    rcu_periph_clock_enable(RCU_GPIOC);
    rcu_periph_clock_enable(RCU_GPIOE);
    rcu_periph_clock_enable(RCU_GPIOG);
    rcu_periph_clock_enable(RCU_DCI);

    /* DCI_PIXCLK(PA6), DCI_HSYNC(PA4), DCI_VSYNC(PB7). */
    gpio_af_set(GPIOA, GPIO_AF_13, GPIO_PIN_4 | GPIO_PIN_6);
    gpio_af_set(GPIOB, GPIO_AF_13, GPIO_PIN_7);

    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_4 | GPIO_PIN_6);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_4 | GPIO_PIN_6);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_7);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_7);

    /* D0(PC6), D1(PC7), D2(PC8), D3(PG11), D4(PE4), D5(PB6), D6(PE5), D7(PE6). */
    gpio_af_set(GPIOC, GPIO_AF_13, GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_8);
    gpio_af_set(GPIOG, GPIO_AF_13, GPIO_PIN_11);
    gpio_af_set(GPIOE, GPIO_AF_13, GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6);
    gpio_af_set(GPIOB, GPIO_AF_13, GPIO_PIN_6);

    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_8);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ,
                            GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_8);
    gpio_mode_set(GPIOG, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_11);
    gpio_output_options_set(GPIOG, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_11);
    gpio_mode_set(GPIOE, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6);
    gpio_output_options_set(GPIOE, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ,
                            GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_6);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_6);
}

static void camera_dci_dma_init(uint32_t hsync_polarity, uint32_t vsync_polarity)
{
    dci_parameter_struct dci_struct;
    dma_single_data_parameter_struct dma_struct;

    camera_dci_gpio_init();

    dci_deinit();
    dci_struct.capture_mode = DCI_CAPTURE_MODE_CONTINUOUS;
    dci_struct.clock_polarity = DCI_CK_POLARITY_RISING;
    dci_struct.hsync_polarity = hsync_polarity;
    dci_struct.vsync_polarity = vsync_polarity;
    dci_struct.frame_rate = DCI_FRAME_RATE_ALL;
    dci_struct.interface_format = DCI_INTERFACE_FORMAT_8BITS;
    dci_init(&dci_struct);

