prophetricker/EdgeCare-GD32-Industrial-Violation-Detection-Terminal/EdgeCare_GD32_Industrial_Violation_Terminal/GD32H759I_START_Demo_Suites/Projects/01_EdgeCare_Industrial_Violation_Terminal/main.c
    rcu_periph_clock_enable(RCU_DMA1);
    rcu_periph_clock_enable(RCU_DMAMUX);

    dma_channel_disable(DMA1, DMA_CH7);
    dma_deinit(DMA1, DMA_CH7);
    dma_single_data_para_struct_init(&dma_struct);
    dma_struct.request = DMA_REQUEST_DCI;
    dma_struct.periph_addr = DCI_DATA_ADDRESS;
    dma_struct.memory0_addr = (uint32_t)g_camera_capture_buffer;
    dma_struct.direction = DMA_PERIPH_TO_MEMORY;
    dma_struct.number = CAMERA_CAPTURE_WORDS;
    dma_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_struct.periph_memory_width = DMA_PERIPH_WIDTH_32BIT;
    dma_struct.circular_mode = DMA_CIRCULAR_MODE_DISABLE;
    dma_struct.priority = DMA_PRIORITY_HIGH;
    dma_single_data_mode_init(DMA1, DMA_CH7, &dma_struct);
}

static uint8_t camera_frame_y_at(uint32_t pixel_index)
{
    uint8_t *frame = (uint8_t *)g_camera_capture_buffer;
    uint32_t pair_offset = (pixel_index / 2U) * 4U;

    /* OV5640 0x4300 low bits select YUYV. In memory: even pixel Y at byte 0, odd pixel Y at byte 2. */
    if(0U == (pixel_index & 1U)) {
        return frame[pair_offset];
    }

    return frame[pair_offset + 2U];
}

static uint8_t edgecare_infer(const uint8_t *input, edgecare_infer_result_t *result)
{
    uint32_t i;
    uint32_t sum = 0U;
    uint8_t min_value = 0xFFU;
    uint8_t max_value = 0U;
    uint8_t value;

    for(i = 0U; i < MODEL_INPUT_BYTES; i++) {
        value = input[i];
        sum += value;
        if(value < min_value) {
            min_value = value;
        }
        if(value > max_value) {
            max_value = value;
        }
    }

    result->mean = (uint8_t)(sum / MODEL_INPUT_BYTES);
    result->contrast = (uint8_t)(max_value - min_value);

    /*
       Placeholder until the PC-trained model is ready. It proves the model interface
       and gives a scene-sensitive number, but it is not a real intrusion classifier.
    */
    result->confidence_percent = (result->contrast > 120U) ? 90U : (uint8_t)((result->contrast * 3U) / 4U);
    result->intrusion = (result->confidence_percent >= 75U) ? 1U : 0U;

    return 1U;
}

static void edgecare_preprocess_gray96_probe(void)
{
    uint32_t x;
    uint32_t y;
    uint32_t checksum = 0U;
    uint32_t sum = 0U;
    uint8_t min_value = 0xFFU;
    uint8_t max_value = 0U;
    uint8_t value;
    edgecare_infer_result_t infer_result;

    for(y = 0U; y < MODEL_INPUT_HEIGHT; y++) {
        uint32_t src_y = (y * CAMERA_FRAME_HEIGHT) / MODEL_INPUT_HEIGHT;
        for(x = 0U; x < MODEL_INPUT_WIDTH; x++) {
            uint32_t src_x = (x * CAMERA_FRAME_WIDTH) / MODEL_INPUT_WIDTH;
            uint32_t src_pixel = (src_y * CAMERA_FRAME_WIDTH) + src_x;
            uint32_t dst_index = (y * MODEL_INPUT_WIDTH) + x;

            value = camera_frame_y_at(src_pixel);
            g_model_input_gray[dst_index] = value;
            sum += value;
            checksum ^= ((uint32_t)value << ((dst_index & 3U) * 8U));
            checksum = (checksum << 3U) | (checksum >> 29U);

            if(value < min_value) {
                min_value = value;
            }
            if(value > max_value) {
                max_value = value;
            }
        }
    }

    printf("preprocess_gray96: source=YUYV_Y qvga=%ux%u out=%ux%u bytes=%lu min=%u max=%u mean=%lu checksum=0x%08lX center=%u,%u,%u,%u\r\n",
           (unsigned int)CAMERA_FRAME_WIDTH,
           (unsigned int)CAMERA_FRAME_HEIGHT,
           (unsigned int)MODEL_INPUT_WIDTH,
           (unsigned int)MODEL_INPUT_HEIGHT,
           (unsigned long)MODEL_INPUT_BYTES,
           min_value,
           max_value,
           (unsigned long)(sum / MODEL_INPUT_BYTES),
           (unsigned long)checksum,
           g_model_input_gray[((MODEL_INPUT_HEIGHT / 2U) * MODEL_INPUT_WIDTH) + (MODEL_INPUT_WIDTH / 2U)],
           g_model_input_gray[((MODEL_INPUT_HEIGHT / 2U) * MODEL_INPUT_WIDTH) + (MODEL_INPUT_WIDTH / 2U) + 1U],
           g_model_input_gray[(((MODEL_INPUT_HEIGHT / 2U) + 1U) * MODEL_INPUT_WIDTH) + (MODEL_INPUT_WIDTH / 2U)],
           g_model_input_gray[(((MODEL_INPUT_HEIGHT / 2U) + 1U) * MODEL_INPUT_WIDTH) + (MODEL_INPUT_WIDTH / 2U) + 1U]);

    if(edgecare_infer(g_model_input_gray, &infer_result)) {
        g_edgecare.confidence_percent = infer_result.confidence_percent;
        g_edgecare.infer_ms = 1U;
        printf("infer_probe: model=stat_placeholder input=gray96 mean=%u contrast=%u conf=%u.%02u intrusion=%u note=replace_with_trained_model\r\n",
               infer_result.mean,
               infer_result.contrast,
               infer_result.confidence_percent / 100U,
               infer_result.confidence_percent % 100U,
               infer_result.intrusion);
    }
}

static void edgecare_camera_capture_attempt(const char *tag, uint32_t hsync_polarity, uint32_t vsync_polarity)
{
    uint32_t timeout = CAMERA_CAPTURE_TIMEOUT;
    uint32_t checksum = 0U;
    uint32_t nonzero_words = 0U;
    uint32_t repeated_words = 0U;
    uint32_t i;
    uint32_t middle_index = CAMERA_CAPTURE_WORDS / 2U;
    uint32_t last_index = CAMERA_CAPTURE_WORDS - 4U;
    FlagStatus hs_before;
    FlagStatus vs_before;
    FlagStatus dma_done;
    FlagStatus dma_tae;
    FlagStatus dma_sde;
    FlagStatus dma_fee;
    FlagStatus dci_ef;
    FlagStatus dci_ovr;
    FlagStatus dci_vsync;
    FlagStatus dci_el;
    FlagStatus dci_fv;

    memset(g_camera_capture_buffer, 0, sizeof(g_camera_capture_buffer));
    SCB_CleanInvalidateDCache_by_Addr((uint32_t *)g_camera_capture_buffer, sizeof(g_camera_capture_buffer));

    camera_dci_dma_init(hsync_polarity, vsync_polarity);

    hs_before = dci_flag_get(DCI_FLAG_HS);
    vs_before = dci_flag_get(DCI_FLAG_VS);
    dma_flag_clear(DMA1, DMA_CH7, DMA_FLAG_FTF | DMA_FLAG_HTF | DMA_FLAG_TAE | DMA_FLAG_SDE | DMA_FLAG_FEE);
    dci_interrupt_flag_clear(DCI_INT_FLAG_EF | DCI_INT_FLAG_OVR | DCI_INT_FLAG_VSYNC | DCI_INT_FLAG_EL);

    dma_channel_enable(DMA1, DMA_CH7);
    dci_enable();
    dci_capture_enable();

    while(RESET == dma_flag_get(DMA1, DMA_CH7, DMA_FLAG_FTF)) {
        if(0U == timeout--) {
            break;
        }
    }

    dci_capture_disable();
    dci_disable();

    dma_done = dma_flag_get(DMA1, DMA_CH7, DMA_FLAG_FTF);
    dma_tae = dma_flag_get(DMA1, DMA_CH7, DMA_FLAG_TAE);
    dma_sde = dma_flag_get(DMA1, DMA_CH7, DMA_FLAG_SDE);
    dma_fee = dma_flag_get(DMA1, DMA_CH7, DMA_FLAG_FEE);
    dci_ef = dci_flag_get(DCI_FLAG_EF);
    dci_ovr = dci_flag_get(DCI_FLAG_OVR);
    dci_vsync = dci_flag_get(DCI_FLAG_VSYNC);
    dci_el = dci_flag_get(DCI_FLAG_EL);
    dci_fv = dci_flag_get(DCI_FLAG_FV);

    dma_channel_disable(DMA1, DMA_CH7);

    SCB_InvalidateDCache_by_Addr((uint32_t *)g_camera_capture_buffer, sizeof(g_camera_capture_buffer));

    for(i = 0U; i < CAMERA_CAPTURE_WORDS; i++) {
        checksum ^= g_camera_capture_buffer[i];
        checksum = (checksum << 1U) | (checksum >> 31U);
        if(0U != g_camera_capture_buffer[i]) {
            nonzero_words++;
        }
        if((i > 0U) && (g_camera_capture_buffer[i] == g_camera_capture_buffer[i - 1U])) {
            repeated_words++;
        }
    }

    printf("camera_capture[%s]: dma=%s words=%lu nonzero=%lu repeated=%lu checksum=0x%08lX hs0=%u vs0=%u hs1=%u vs1=%u fv=%u ef=%u ovr=%u vsif=%u elif=%u dmaerr=%u%u%u first=%08lX,%08lX,%08lX,%08lX mid=%08lX,%08lX,%08lX,%08lX last=%08lX,%08lX,%08lX,%08lX\r\n",
           tag,
           (RESET != dma_done) ? "done" : "timeout",
           (unsigned long)CAMERA_CAPTURE_WORDS,
           (unsigned long)nonzero_words,
           (unsigned long)repeated_words,
           (unsigned long)checksum,
           (SET == hs_before) ? 1U : 0U,
           (SET == vs_before) ? 1U : 0U,
           (SET == dci_flag_get(DCI_FLAG_HS)) ? 1U : 0U,
           (SET == dci_flag_get(DCI_FLAG_VS)) ? 1U : 0U,
           (SET == dci_fv) ? 1U : 0U,
           (SET == dci_ef) ? 1U : 0U,
           (SET == dci_ovr) ? 1U : 0U,
           (SET == dci_vsync) ? 1U : 0U,
           (SET == dci_el) ? 1U : 0U,
           (SET == dma_tae) ? 1U : 0U,
           (SET == dma_sde) ? 1U : 0U,
           (SET == dma_fee) ? 1U : 0U,
           (unsigned long)g_camera_capture_buffer[0],
           (unsigned long)g_camera_capture_buffer[1],
           (unsigned long)g_camera_capture_buffer[2],
           (unsigned long)g_camera_capture_buffer[3],
           (unsigned long)g_camera_capture_buffer[middle_index],
           (unsigned long)g_camera_capture_buffer[middle_index + 1U],
           (unsigned long)g_camera_capture_buffer[middle_index + 2U],
           (unsigned long)g_camera_capture_buffer[middle_index + 3U],
           (unsigned long)g_camera_capture_buffer[last_index],
           (unsigned long)g_camera_capture_buffer[last_index + 1U],
           (unsigned long)g_camera_capture_buffer[last_index + 2U],
           (unsigned long)g_camera_capture_buffer[last_index + 3U]);

    while(RESET == usart_flag_get(EVAL_COM, USART_FLAG_TC)) {
    }

    if(RESET != dma_done) {
        edgecare_preprocess_gray96_probe();
    }
}

static void edgecare_camera_capture_probe(void)
{
    printf("camera_capture_probe: start qvga=%ux%u bytes=%lu words=%lu timeout=%lu working_pol=hs_blank_low_vs_blank_high\r\n",
           (unsigned int)CAMERA_FRAME_WIDTH,
           (unsigned int)CAMERA_FRAME_HEIGHT,
           (unsigned long)CAMERA_CAPTURE_BYTES,
           (unsigned long)CAMERA_CAPTURE_WORDS,
           (unsigned long)CAMERA_CAPTURE_TIMEOUT);
    printf("camera_dvp: PCLK=PA6 HREF=PA4 SYNC=PB7 D0=PC6 D1=PC7 D2=PC8 D3=PG11 D4=PE4 D5=PB6 D6=PE5 D7=PE6\r\n");
    camera_dvp_gpio_activity_probe();

    edgecare_camera_capture_attempt("working_hs_blank_low_vs_blank_high",
                                    DCI_HSYNC_POLARITY_LOW,
                                    DCI_VSYNC_POLARITY_HIGH);
}

static void alarm_set(uint8_t active)
{
    g_edgecare.alarm_active = active ? 1U : 0U;

    if(g_edgecare.alarm_active) {
        gpio_bit_reset(ALARM_GPIO_PORT, ALARM_GPIO_PIN);
    } else {
        gpio_bit_set(ALARM_GPIO_PORT, ALARM_GPIO_PIN);
    }
}

static void edgecare_log_status(void)
{
    printf("[%lu] state=%s radar=%u infer_ms=%lu conf=%u.%02u alarm=%u seq=%lu\r\n",
           (unsigned long)g_edgecare.ts_ms,
           edgecare_state_name(g_edgecare.state),
           g_edgecare.radar_triggered,
           (unsigned long)g_edgecare.infer_ms,
           g_edgecare.confidence_percent / 100U,
           g_edgecare.confidence_percent % 100U,
           g_edgecare.alarm_active,
           (unsigned long)g_edgecare.seq);

    while(RESET == usart_flag_get(EVAL_COM, USART_FLAG_TC)) {
    }
}

static void edgecare_step(void)
{
    g_edgecare.radar_triggered = radar_is_triggered();
    g_edgecare.infer_ms = 0U;

    if(g_edgecare.radar_triggered) {
        g_edgecare.state = EDGECARE_STATE_ALARM;
        g_edgecare.confidence_percent = 100U;
        alarm_set(1U);
    } else {
        g_edgecare.state = EDGECARE_STATE_IDLE;
        g_edgecare.confidence_percent = 0U;
        alarm_set(0U);
    }

    g_edgecare.seq++;
    edgecare_log_status();
}

int main(void)
{
    uint8_t camera_detected;

    cache_enable();
    systick_config();
    gd_eval_com_init(EVAL_COM);
    alarm_gpio_init();
    radar_gpio_init();

    printf("\r\n%s boot: EdgeCare GD32H759 terminal bring-up\r\n", EDGECARE_DEVICE_ID);
    printf("log_format: [ts_ms] state=... radar=... infer_ms=... conf=... alarm=... seq=...\r\n");
    printf("radar_input: LD2410 OUT active-high on PF8, alarm active-low on PA8\r\n");
    printf("camera_sccb: SCL=PB10 SDA=PB11 RES=PD0 PWON=PD1\r\n");
    printf("camera_capture_probe: enabled; expect one camera_capture line before periodic state logs\r\n");
    camera_detected = edgecare_camera_id_probe();
    if(camera_detected) {
        (void)edgecare_ov5640_qvga_stream_init();
    } else {
        printf("camera_init: skipped because OV5640 ID was not confirmed\r\n");
    }
    edgecare_camera_capture_probe();

    while(1) {
        edgecare_step();
        delay_1ms(EDGECARE_LOG_PERIOD_MS);
        g_edgecare.ts_ms += EDGECARE_LOG_PERIOD_MS;
    }
}

#ifdef GD_ECLIPSE_GCC
int __io_putchar(int ch)
{
    usart_data_transmit(EVAL_COM, (uint8_t)ch);
    while(RESET == usart_flag_get(EVAL_COM, USART_FLAG_TBE)) {
    }
    return ch;
}
#else
int fputc(int ch, FILE *f)
{
    (void)f;
    usart_data_transmit(EVAL_COM, (uint8_t)ch);
    while(RESET == usart_flag_get(EVAL_COM, USART_FLAG_TBE)) {
    }
    return ch;
}
#endif
